InformationRegisters/АдресныеОбъекты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>АдресныеОбъекты</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>РодительскийИдентификатор</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МуниципальныйРодительскийИдентификатор</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>120</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сокращение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодКЛАДР</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительныеАдресныеСведения</Name>
					<Comment>Служебный идентификатор комбинации кодов ОКАТО и т.п.</Comment>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Уровень</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Comment>Глобальный уникальный идентификатор адресного объекта ФНС</Comment>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодСубъектаРФ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/Города.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>Города</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИспользуетсяВРознице</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользуетсяВПроизводстве</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодКЛАДР</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonForms/УДАЛИТЬ_ФормаВводаАдреса/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//КодГорода = Параметры.КодГорода;
	//КодНасПункта = Параметры.КодНасПункта;
	//КодСубъектаРФ = Параметры.КодСубъектаРФ;
	
	ПустойИдентификатор = Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000");
	
	Адрес = Параметры.Адрес;
	ИдентификаторУлицы = Параметры.ИдентификаторУлицы;
	РазложитьСтрокуАдреса(Адрес);
	
	УправлениеФормой();
	
	//++ №10663 фильтр городов в зависимости от источника
	Параметры.Свойство("ФильтроватьГородаТолькоРозница", ФильтроватьГородаТолькоРозница);
	
	НовыйПараметрВыбора = Новый ПараметрВыбора(?(ФильтроватьГородаТолькоРозница, "Отбор.ИспользуетсяВРознице", "Отбор.ИспользуетсяВПроизводстве"), Истина);
	
	МассивПараметровВыбора = Новый Массив;
	МассивПараметровВыбора.Добавить(НовыйПараметрВыбора);
	
	Элементы.Город.ПараметрыВыбора = Новый ФиксированныйМассив(МассивПараметровВыбора);
	//-- №10663
	
	ЗаполнитьКодыАдреса(); // №14051 получаем коды + индетификатор родителя
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ГородПриИзменении(Элемент)
	
	ЗаполнитьКодыАдреса();
	СформироватьСтрокуАдресаПоЗначениямПолейФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура УлицаПриИзменении(Элемент)
	
	СформироватьСтрокуАдресаПоЗначениямПолейФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура УлицаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СписокУлиц = ПолучитьСписокВсехУлиц();
	
	ВыбЭлемент = СписокУлиц.ВыбратьЭлемент("Выберите улицу");
	Если ВыбЭлемент = Неопределено Тогда 
		Улица = "";
		ИдентификаторУлицы = "";
	Иначе
		ИдентификаторУлицы = ВыбЭлемент.Значение.Идентификатор;
		Улица = Строка(ВыбЭлемент.Значение.Представление);
		ОбновитьОтображениеДанных();
		
		ЭтаФорма.ТекущийЭлемент = Элементы.Дом;
		СформироватьСтрокуАдресаПоЗначениямПолейФормы();
	КонецЕсли 
	
КонецПроцедуры

&НаКлиенте
Процедура УлицаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИдентификаторУлицы = ВыбранноеЗначение.Идентификатор;
	Улица = Строка(ВыбранноеЗначение.Представление);
	ОбновитьОтображениеДанных();
	
	ЭтаФорма.ТекущийЭлемент = Элементы.Дом;
	СформироватьСтрокуАдресаПоЗначениямПолейФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура УлицаАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	Если СтрДлина(Текст) < 1 Или Не ЗначениеЗаполнено(Город)Тогда 
		// Нет вариантов, список пуст, стандартную обработку не надо трогать.
		Возврат;
	КонецЕсли;
	
	//улица уже могла быть сохранена в виде строки "ул Название". Разделяем строку на значения, разделитель - пробел. пытаемся найти улицу по второму слову, если оно есть, иначе - по первому
	ИскомаяСтрока = Текст;
	СписокСлов = СтрРазделить(Текст, " ", ложь);
	Если СписокСлов.Количество() > 1 Тогда
		Для НомерПозиции = 1 По СписокСлов.Количество()-1 Цикл
			ИскомаяСтрока = ИскомаяСтрока + " " + СокрЛП(СписокСлов[НомерПозиции]);
		КонецЦикла;
		ИскомаяСтрока = СокрЛП(ИскомаяСтрока);
	ИначеЕсли СписокСлов.Количество() > 0 Тогда
		ИскомаяСтрока = СокрЛП(СписокСлов[0]);
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	СписокУлиц = ПолучитьСписокУлицПоЧастиНаименования(ИскомаяСтрока);
	Если НЕ СписокУлиц.Количество() = 0 Тогда
		ДанныеВыбора = СписокУлиц;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УлицаОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	Улица = Текст;
КонецПроцедуры

&НаКлиенте
Процедура ДомПриИзменении(Элемент)
	
	СформироватьСтрокуАдресаПоЗначениямПолейФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ДомНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(ИдентификаторУлицы) тогда
		СписокДомов = ПолучитьСписокДомов(ИдентификаторУлицы);
		
		ВыбЭлемент = СписокДомов.ВыбратьЭлемент("Выберите дом");
		Если ВыбЭлемент = Неопределено Тогда 
			Дом = "";
		Иначе
			Дом = Строка(ВыбЭлемент.Представление);
			ОбновитьОтображениеДанных();
			
			ЭтаФорма.ТекущийЭлемент = Элементы.Квартира;
			СформироватьСтрокуАдресаПоЗначениямПолейФормы();
		КонецЕсли 
	КонецЕсли 
	
КонецПроцедуры

&НаКлиенте
Процедура ДомОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Дом = ВыбранноеЗначение;
	ОбновитьОтображениеДанных();
	
	ЭтаФорма.ТекущийЭлемент = Элементы.Квартира;
	СформироватьСтрокуАдресаПоЗначениямПолейФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ДомАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	//Если СтрДлина(Текст) < 1 Или НЕ ЗначениеЗаполнено(ИдентификаторУлицы) Тогда 
	//	// Нет вариантов, список пуст, стандартную обработку не надо трогать.
	//	Возврат;
	//КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ИдентификаторУлицы) Тогда 
		// Нет вариантов, список пуст, стандартную обработку не надо трогать.
		Возврат;
	КонецЕсли;
	
	//дом уже мог быть сохранен в виде строки "дом 53". Разделяем строку на значения, разделитель - пробел. пытаемся найти дом по второму слову, если оно есть, иначе - по первому
	ИскомаяСтрока = Текст;
	СписокСлов = СтрРазделить(Текст, " ", ложь);
	Если СписокСлов.Количество() > 1 Тогда
		ИскомаяСтрока = СокрЛП(СписокСлов[1]);
	ИначеЕсли СписокСлов.Количество() > 0 Тогда
		ИскомаяСтрока = СокрЛП(СписокСлов[0]);
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	ПолныйСписокДомов = ПолучитьСписокДомовПоЧастиСтроки(ИдентификаторУлицы, ИскомаяСтрока);
	Если НЕ ПолныйСписокДомов.Количество() = 0 Тогда
		ДанныеВыбора = ПолныйСписокДомов;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДомОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	Дом = Текст;
КонецПроцедуры



&НаКлиенте
Процедура КвартираПриИзменении(Элемент)
	
	СформироватьСтрокуАдресаПоЗначениямПолейФормы();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	
	Ответ = Новый Структура;
	Ответ.Вставить("Представление", Адрес);
	Ответ.Вставить("ИдентификаторУлицы", ИдентификаторУлицы);
	
	Закрыть(Ответ);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыФункции

&НаСервере
Процедура УправлениеФормой()
	
	Если ЗначениеЗаполнено(Улица) И НЕ ЗначениеЗаполнено(ИдентификаторУлицы) Тогда
		Элементы.ДекорацияУлицаНеНайдена.Видимость = Истина;
	Иначе
		Элементы.ДекорацияУлицаНеНайдена.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура РазложитьСтрокуАдреса(СтрокаАдреса)
	
	МассивПодстрок = ОбщийМодуль.РазложитьСтрокуВМассивПодстрок(СтрокаАдреса, ",", Ложь);
	
	//по умолчанию считаем что в массиве данные хранятся так:
	//0 - город
	//1 - улица
	//2 - дом
	//3 - квартира
	
	Если МассивПодстрок.Количество() > 0 Тогда
		Город = ПолучитьСсылкуНаГород(СокрЛП(МассивПодстрок[0]));
	КонецЕсли;
	
	Если МассивПодстрок.Количество() > 1 Тогда
		Улица = СокрЛП(МассивПодстрок[1]);
	КонецЕсли;
	
	Если МассивПодстрок.Количество() > 2 Тогда
		Дом = СокрЛП(МассивПодстрок[2]);
	КонецЕсли;
	
	Если МассивПодстрок.Количество() > 3 Тогда
		Квартира = СокрЛП(МассивПодстрок[3]);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСсылкуНаГород(СтрокаГород)
	
	Возврат Справочники.Города.НайтиПоНаименованию(СтрокаГород, Ложь);
	
КонецФункции

&НаСервере
Процедура ЗаполнитьКодыАдреса()
	
	ОбщийМодульСервер.ЗаполнитьКодыАдреса(Город, КодГорода, КодНасПункта, КодСубъектаРФ, ИдентификаторРодителя);
	
КонецПроцедуры

&НаСервере
Процедура СформироватьСтрокуАдресаПоЗначениямПолейФормы()
	
	Адрес = Строка(Город) + ", " + Улица + ", " + Дом + ", " + Квартира;
	УправлениеФормой();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокВсехУлиц()
	
	СписокУлиц = Новый СписокЗначений;
	
	//++ 3.1
	//Если ЗначениеЗаполнено(КодГорода) ИЛИ ЗначениеЗаполнено(КодНасПункта) ИЛИ ЗначениеЗаполнено(КодСубъектаРФ) Тогда
	Если НЕ ИдентификаторРодителя = ПустойИдентификатор ИЛИ ЗначениеЗаполнено(КодСубъектаРФ) Тогда
	//-- 3.1
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	АдресныеОбъекты.Наименование КАК Наименование,
		|	АдресныеОбъекты.Сокращение КАК Сокращение,
		|	АдресныеОбъекты.Идентификатор КАК Идентификатор
		|ИЗ
		|	РегистрСведений.АдресныеОбъекты КАК АдресныеОбъекты
		|ГДЕ		
		|	АдресныеОбъекты.Уровень > 6
		//++ 3.1
		//|	И ВЫБОР
		//|		КОГДА НЕ &КодГорода = 0
		//|			ТОГДА АдресныеОбъекты.КодГорода = &КодГорода
		//|		ИНАЧЕ ИСТИНА
		//|	КОНЕЦ
		//|	И ВЫБОР
		//|       КОГДА НЕ &КодНасПункта = 0 
		//|			ТОГДА АдресныеОбъекты.КодНаселенногоПункта = &КодНасПункта
		//|		ИНАЧЕ ИСТИНА
		//|	КОНЕЦ
		|	И ВЫБОР
		|       КОГДА НЕ &ОтборПоИдентификаторуРодителя = 0 
		|			ТОГДА АдресныеОбъекты.РодительскийИдентификатор = &ИдентификаторРодителя
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ
		//-- 3.1		
		|	И ВЫБОР
		|       КОГДА НЕ &КодСубъектаРФ = 0 
		|			ТОГДА АдресныеОбъекты.КодСубъектаРФ = &КодСубъектаРФ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ
		|";
		//Запрос.УстановитьПараметр("КодГорода",КодГорода);
		//Запрос.УстановитьПараметр("КодНасПункта", КодНасПункта);
		Запрос.УстановитьПараметр("ОтборПоИдентификаторуРодителя", НЕ ИдентификаторРодителя = ПустойИдентификатор);
		Запрос.УстановитьПараметр("ИдентификаторРодителя", ИдентификаторРодителя);
		Запрос.УстановитьПараметр("КодСубъектаРФ", КодСубъектаРФ);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			Представление = Выборка.Сокращение + " " + Выборка.Наименование;
			
			Структ = Новый Структура;
			Структ.Вставить("Представление", Представление);
			Структ.Вставить("Идентификатор", Выборка.Идентификатор);
			
			СписокУлиц.Добавить(Структ,Представление);
		КонецЦикла;
	КонецЕсли;
	
	Возврат СписокУлиц;
	
КонецФункции

&НаСервере
Функция ПолучитьСписокУлицПоЧастиНаименования(Знач ЧастьНаименования)
	
	Возврат ОбщийМодульВызовСервера.ПолучитьСписокУлицПоЧастиНаименования(ЧастьНаименования, КодГорода, КодНасПункта, КодСубъектаРФ, ИдентификаторРодителя);
	
КонецФункции

&НаСервере
Функция ПолучитьСписокДомов(ИдентификаторУлицы)
	
	СписокДомов = Новый СписокЗначений;
	
	//++ 3.1
	//ТаблицаДомов = УправлениеКонтактнойИнформациейСлужебный.СписокДомов(ИдентификаторУлицы);
	ТаблицаДомов = Обработки.РасширенныйВводКонтактнойИнформации.СписокДомов(ИдентификаторУлицы);
	//-- 3.1
	
	Если ТипЗнч(ТаблицаДомов) = Тип("ТаблицаЗначений") Тогда
		Для Каждого ТекущийДом Из ТаблицаДомов Цикл
			СтрокаДом = СтрЗаменить(ТекущийДом.Представление, ",", "");
			СписокДомов.Добавить(СтрокаДом, СтрокаДом);
		КонецЦикла;
	КонецЕсли;
	
	Возврат СписокДомов;
	
КонецФункции

&НаСервере
Функция ПолучитьСписокДомовПоЧастиСтроки(ИдентификаторУлицы, ИскомаяСтрока)
	
	СписокДомов = Новый СписокЗначений;
	
	//++ 3.1
	//ТаблицаДомов = УправлениеКонтактнойИнформациейСлужебный.СписокДомов(ИдентификаторУлицы);
	ТаблицаДомов = Обработки.РасширенныйВводКонтактнойИнформации.СписокДомов(ИдентификаторУлицы);
	//-- 3.1
	
	Если ТипЗнч(ТаблицаДомов) = Тип("ТаблицаЗначений") Тогда
		Для Каждого ТекущийДом Из ТаблицаДомов Цикл
			Если СтрНайти(ТекущийДом.Представление, ИскомаяСтрока) > 0 Тогда
				СтрокаДом = СтрЗаменить(ТекущийДом.Представление, ",", "");
				СписокДомов.Добавить(СтрокаДом, СтрокаДом);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат СписокДомов;
	
КонецФункции

#КонецОбласти
